# 문제 1. 데이터 가져오기 
- titanic_train.csv 파일과 titanic_test.csv 파일을 불러오세요
- train, test로 저장하기

In [4]:
import pandas as pd
# 코드

train = pd.read_csv("data/titanic_train.csv")
test = pd.read_csv("data/titanic_test.csv")
train.shape, test.shape

((891, 12), (418, 11))

In [5]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
train.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

# 문제 2. loc 활용
- Passenger ID가 9인 승객 정보 가져오기
- loc문법만 활용

In [24]:
# 코드
train.loc[8]

PassengerId                                                    9
Survived                                                       1
Pclass                                                         3
Name           Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
Sex                                                       female
Age                                                         27.0
SibSp                                                          0
Parch                                                          2
Ticket                                                    347742
Fare                                                     11.1333
Cabin                                                        NaN
Embarked                                                       S
Name: 8, dtype: object

# 문제 3. loc 활용
- Passenger ID가 1-10사이에서 짝수 ID만 가져오기 (슬라이싱만 활용)
- 특정 컬럼만 조회 : PassengerId, Survived, Sex, Fare, Embarked
- loc문법만 활용

In [25]:
# 코드
train.loc[ train["PassengerId"][1:10:2], ['PassengerId', 'Survived', 'Sex', 'Fare', 'Embarked']]

    PassengerId  Survived     Sex     Fare Embarked
2             3         1  female   7.9250        S
4             5         0    male   8.0500        S
6             7         0    male  51.8625        S
8             9         1  female  11.1333        S
10           11         1  female  16.7000        S

# 문제 4. GroupBy 연산
- 아래와 같이 pivot Table 구현한 것을 Group By 연산으로 적용할 것

In [16]:
train.pivot_table(index='Sex', columns='Pclass', values='Fare', aggfunc='mean')

Pclass           1          2          3
Sex
female  106.125798  21.970121  16.118810
male     67.226127  19.741782  12.661633

In [22]:
# 코드
result = train.groupby(['Sex', 'Pclass'])['Fare'].mean()
result.unstack()

Pclass           1          2          3
Sex
female  106.125798  21.970121  16.118810
male     67.226127  19.741782  12.661633

# 문제 5 Join문제
- members.csv와 orders.csv 파일 확인
    + members.csv : 회원정보 
    + orders.csv : 주문정보 
- 성별, 연령별 주문 문제 5 Join문제
- members.csv와 orders.csv 파일 확인
    + members.csv : 회원정보 
    + orders.csv : 주문정보 
- 성별, 연령별 주문 평균금액 구하기
- 주의) CSV 파일 열어보지 말기

In [41]:
# 코드
members = pd.read_csv("data/members.csv")
orders = pd.read_csv("data/orders.csv")

# 조인 하려면 key값 확인
# 컬럼명 확인
print(f"Members Columns: {members.columns}")
print(f"Orders Columns: {orders.columns}")

df = pd.merge(members, orders, on = "회원ID", how="inner")
result = df.groupby(['성별', '나이'])['주문금액'].mean()
result

Members Columns: Index(['회원ID', '회원명', '나이', '성별'], dtype='object')
Orders Columns: Index(['주문ID', '회원ID', '주문금액', '주문일자'], dtype='object')

성별  나이
F   27    40774.500000
    29    71044.666667
    32    39754.000000
    35    45776.500000
M   25    50155.000000
    28    94127.500000
    31    84481.000000
    42    52919.000000
    45    65578.500000
Name: 주문금액, dtype: float64